/* 問5 */
/*
以下は、貸し出し記録テーブル（rental）上、利用者コードがB200405、ISBNコードが4-0010-0000-1のデータについて、
貸出日を今日の日付に更新するためのSQL命令ですが、誤りが2点あります。誤りを指摘してください。
*/

UPDATE
    rental
SET
    rental_date CURRENT_DATE
WHERE
    user_id='B200405'
    OR
    isbn='4-0010-0000-1'
;
/** 解答 **/
1. SET以下の"rental_date"と"CURRENT_DATE"の間には"="が必要。
2. 「利用者コードがB200405、ISBNコードが4-0010-0000-1のデータ」とあるので、条件をANDでつなぐ

正しくは、
UPDATE -- 以下のテーブルの値を更新
    rental -- 貸し出し記録テーブル
SET -- 以下のように値を更新
    rental_date=CURRENT_DATE -- 貸出日を今日の日付とする
WHERE -- 以下の条件に合致するカラムを更新
        user_id='B200405' -- 利用者コードがB200405
    AND -- かつ
        isbn='4-0010-0000-1' -- ISBNコードが4-0010-0000-1
;

/* 更新前 */
+----+---------+---------------+-------------+----------+
| id | user_id | isbn          | rental_date | returned |
+----+---------+---------------+-------------+----------+
|  1 | A200501 | 4-0010-0000-0 | 2011-12-01  |        9 |
....
| 22 | B200505 | 4-7981-0959-2 | 2013-01-12  |        0 |
| 23 | A200405 | 4-8833-0000-3 | 2012-12-22  |        0 |
| 24 | B200403 | 4-0010-0000-9 | 2012-12-27  |        0 |
| 25 | B200405 | 4-0010-0000-1 | 2013-03-10  |        0 |
+----+---------+---------------+-------------+----------+
25 rows in set (0.01 sec)

/* 更新後 */
+----+---------+---------------+-------------+----------+
| id | user_id | isbn          | rental_date | returned |
+----+---------+---------------+-------------+----------+
|  1 | A200501 | 4-0010-0000-0 | 2011-12-01  |        9 |
....
| 22 | B200505 | 4-7981-0959-2 | 2013-01-12  |        0 |
| 23 | A200405 | 4-8833-0000-3 | 2012-12-22  |        0 |
| 24 | B200403 | 4-0010-0000-9 | 2012-12-27  |        0 |
| 25 | B200405 | 4-0010-0000-1 | 2018-10-11  |        0 |
+----+---------+---------------+-------------+----------+
25 rows in set (0.00 sec)