/* 問１ */
/* 著者情報テーブル（books）からtitle列を取り出してみましょう。*/

-- 著者情報テーブル（books）からtitle列を取り出す
mysql> select title from books;
+--------------------------+
| title                    |
+--------------------------+
| ハムスターの観察         |
| PHPドリル                |
| フェレットの観察         |
| らくだの観察日記         |
| あひるの観察日記         |
| かえるの観察日記         |
| SQL入門                  |
| JSPリファレンス          |
| PHP5サンプル集           |
| XML辞典                  |
| PEAR入門                 |
| SQLリファレンス          |
| SQLプチブック            |
| XMLリファレンス          |
+--------------------------+
14 rows in set (0.00 sec)
