/* 問1 */
/*
所属部署テーブル（depart）にない所属部署に属する社員を社員テーブル（employee）から削除してください。
*/

/** 解答 **/
DELETE FROM -- テーブルからデータを削除
    employee -- 社員テーブル
WHERE -- 条件で絞りこみ
    depart_id -- 所属部署コード
NOT IN -- 所属部署コードが以下に含まれていない
    (
        SELECT -- データの抽出
            depart_id -- 所属部署コード
        FROM -- テーブルの選択
            depart -- 所属部署テーブル
    )
;

/* 削除前 */
+---------+-----------+
| s_id    | depart_id |
+---------+-----------+
| AI00001 | S02       |
| DA00001 | J01       |
| FU00001 | E01       |
| FU00002 | E01       |
| HA0002  | E01       |
| KA00001 | S01       |
| KA00002 | S01       |
| KA00003 | J01       |
| KI00001 | S01       |
| NA00001 | S02       |
| NI00001 | Z99       |
| NI00002 | Z99       |
| NO00001 | S02       |
| SA00001 | S01       |
| SE00001 | E01       |
| SI00001 | J01       |
| TA00001 | S01       |
| TA00002 | E01       |
| TE00001 | E01       |
| TI00001 | S02       |
| TO00001 | J01       |
| TO00002 | S02       |
| TU00001 | S02       |
| UE00001 | J01       |
| YA00001 | S01       |
+---------+-----------+
25 rows in set (0.00 sec)

/* 削除後 */
+---------+-----------+
| s_id    | depart_id |
+---------+-----------+
| AI00001 | S02       |
| DA00001 | J01       |
| FU00001 | E01       |
| FU00002 | E01       |
| HA0002  | E01       |
| KA00001 | S01       |
| KA00002 | S01       |
| KA00003 | J01       |
| KI00001 | S01       |
| NA00001 | S02       |
| NO00001 | S02       |
| SA00001 | S01       |
| SE00001 | E01       |
| SI00001 | J01       |
| TA00001 | S01       |
| TA00002 | E01       |
| TE00001 | E01       |
| TI00001 | S02       |
| TO00001 | J01       |
| TO00002 | S02       |
| TU00001 | S02       |
| UE00001 | J01       |
| YA00001 | S01       |
+---------+-----------+
23 rows in set (0.00 sec)

/* 所属部署テーブル */
mysql> select * from depart;
+-----------+-----------------+
| depart_id | depart_name     |
+-----------+-----------------+
| E01       | 第一営業部      |
| E02       | 第二営業部      |
| J01       | 人事部          |
| S01       | 経営企画部      |
| S02       | 総務部          |
+-----------+-----------------+
5 rows in set (0.00 sec)