/* 問1 */
/*
社員テーブル（employee）と所属部署テーブル（depart）、タイムカードテーブル（time_card）を結合し、
社員コード'DA00001'における2012年12月分の勤務時間を日付について昇順に出力してみましょう。
出力列の別名は、先頭から「所属部署名」「社員氏名」「勤務時間」とします。
*/

/** 解答 **/
SELECT -- 選択
    d.depart_name AS 所属部署名, -- 所属部署名
    CONCAT(e.l_name, e.f_name) AS 社員氏名, -- 社員氏名
    tc.work_time AS 勤務時間 -- 勤務時間
FROM -- テーブルを選択
    (
        employee AS e -- 社員テーブル
    INNER JOIN -- 内部結合
        depart AS d -- 所属部署テーブル
    ON -- 以下の項目で結合
        e.depart_id = d.depart_id -- 所属部署コードについて結合
    )
INNER JOIN -- さらに結合
    time_card AS tc -- タイムカードテーブル
ON -- 以下の項目について結合
    e.s_id = tc.s_id -- 社員コードについて結合
WHERE -- 条件で絞り込み
    (
        e.s_id = 'DA00001' -- 社員コードが'DA00001'
    AND
        tc.r_date BETWEEN '2012-12-01' AND '2012-12-31' -- 12月のすべての日を検索
    )
ORDER BY -- 以下のカラムについてソート
    tc.r_date ASC -- 日付について昇順
;

+-----------------+--------------+--------------+
| 所属部署名      | 社員氏名     | 勤務時間     |
+-----------------+--------------+--------------+
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |           10 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |            9 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |            9 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |           10 |
| 人事部          | 大門一郎     |            9 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |            9 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |           10 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |            8 |
| 人事部          | 大門一郎     |            8 |
+-----------------+--------------+--------------+
20 rows in set (0.01 sec)