/* 問4 */
/*
社員テーブル（employee）から氏（カナ）が「ア」で始まる社員の情報だけを取り出してみましょう。
*/

-- 社員テーブル（employee）から氏（カナ）が「ア」で始まる社員の情報だけを取り出す
mysql> select * from employee where l_name_kana like 'ア%';
+---------+--------+--------+--------------+-------------+------+--------+-----------+------+-------------+---------+
| s_id    | l_name | f_name | l_name_kana  | f_name_kana | sex  | class  | depart_id | b_id | last_update | retired |
+---------+--------+--------+--------------+-------------+------+--------+-----------+------+-------------+---------+
| AI00001 | 相沢   | 聡     | アイザワ     | サトシ      |    1 | 部長   | S02       | NULL | 2012-02-24  |       0 |
+---------+--------+--------+--------------+-------------+------+--------+-----------+------+-------------+---------+
1 row in set (0.00 sec)
