/* 問4 */
/*
以下は、社員テーブル（employee）に対して、表のデータを挿入するためのSQL命令ですが、2点誤りがあります。
誤りを指摘してください。
*/

INSERT INTO
    employee
    (
        s_id
        l_name
        depart_id
        last_update
    )
VALUE
    (
        'WA00001',
        '和田',
        'J01',
        CURRENT_DATE
    )
;

/** 解答 **/
1. employee(...)での項目列挙において、カンマがない。
2. "VALUE"ではなく、"VALUES"とすべき。

正しくは、
INSERT INTO -- 以下のテーブルにデータを挿入
    employee -- 社員テーブル
    (
        s_id, -- 社員コード
        l_name, -- 社員名（氏）
        depart_id, -- 所属部署コード
        last_update -- 最終更新日
    )
VALUES -- データの値
    (
        'WA00001', -- 社員コード
        '和田', -- 社員名（氏）
        'J01', -- 所属部署コード
        CURRENT_DATE -- 最終更新日
    )
;

/* 挿入前 */
+---------+-----------+-----------+--------------+-----------------+------+--------------------+-----------+---------+-------------+---------+
| s_id    | l_name    | f_name    | l_name_kana  | f_name_kana     | sex  | class              | depart_id | b_id    | last_update | retired |
+---------+-----------+-----------+--------------+-----------------+------+--------------------+-----------+---------+-------------+---------+
| AI00001 | 相沢      | 聡        | アイザワ     | サトシ          |    1 | 部長               | S02       | NULL    | 2012-02-24  |       0 |
....
| UE00001 | 上田      | 一也      | ウエダ       | カズヤ          |    1 | 部長               | J01       | NULL    | 2011-11-12  |       0 |
| YA00001 | 山田      | 奈美      | ヤマダ       | ナミ            |    2 | 課長               | S01       | SA00001 | 2012-10-15  |       0 |
+---------+-----------+-----------+--------------+-----------------+------+--------------------+-----------+---------+-------------+---------+
26 rows in set (0.00 sec)


/* 挿入後 */
+---------+-----------+-----------+--------------+-----------------+------+--------------------+-----------+---------+-------------+---------+
| s_id    | l_name    | f_name    | l_name_kana  | f_name_kana     | sex  | class              | depart_id | b_id    | last_update | retired |
+---------+-----------+-----------+--------------+-----------------+------+--------------------+-----------+---------+-------------+---------+
| AI00001 | 相沢      | 聡        | アイザワ     | サトシ          |    1 | 部長               | S02       | NULL    | 2012-02-24  |       0 |
....
| UE00001 | 上田      | 一也      | ウエダ       | カズヤ          |    1 | 部長               | J01       | NULL    | 2011-11-12  |       0 |
| WA00001 | 和田      | NULL      | NULL         | NULL            | NULL | NULL               | J01       | NULL    | 2018-09-27  |    NULL |
| YA00001 | 山田      | 奈美      | ヤマダ       | ナミ            |    2 | 課長               | S01       | SA00001 | 2012-10-15  |       0 |
+---------+-----------+-----------+--------------+-----------------+------+--------------------+-----------+---------+-------------+---------+
27 rows in set (0.00 sec)