/* 問2 */
/*
店舗テーブル（shop）からすべての店舗コードを抜き出し、月間売り上げテーブル（sales）に対して挿入してみましょう。
その際、売り上げ対象年月には今月の日付（YYYY-MM）を、売上高には0を固定値でセットするものとします。
*/

/** 解答 **/
INSERT INTO -- 以下のテーブルにデータを挿入
    sales -- 店舗テーブル
    (
        s_id, -- 店舗コード
        s_date, -- 売り上げ対象年月
        s_value -- 売上高
    )
SELECT -- データを取得
    s_id, -- 店舗コード
    DATE_FORMAT(CURRENT_DATE, '%Y-%m'), -- 現在の日付を'YYYY-MM'の形にフォーマット
    0 -- 固定値として0を挿入
FROM -- テーブルを指定
    shop -- 店舗テーブル
;

/* 実行結果 */

/* 挿入前 */
+-------+---------+---------+
| s_id  | s_date  | s_value |
+-------+---------+---------+
| H0001 | 2012-11 |    9975 |
| H0001 | 2012-12 |    9861 |
| K0001 | 2012-11 |   10142 |
| K0001 | 2012-12 |   11234 |
| K0002 | 2012-11 |   10124 |
| K0002 | 2012-12 |   10456 |
| M0001 | 2012-11 |   10784 |
| M0001 | 2012-12 |   11145 |
| M0002 | 2012-11 |   12032 |
| N0001 | 2012-11 |    9965 |
| N0001 | 2012-12 |   11023 |
+-------+---------+---------+
11 rows in set (0.00 sec)


/* 挿入後 */
+-------+---------+---------+
| s_id  | s_date  | s_value |
+-------+---------+---------+
| H0001 | 2012-11 |    9975 |
| H0001 | 2012-12 |    9861 |
| H0001 | 2018-09 |       0 |
| K0001 | 2012-11 |   10142 |
| K0001 | 2012-12 |   11234 |
| K0001 | 2018-09 |       0 |
| K0002 | 2012-11 |   10124 |
| K0002 | 2012-12 |   10456 |
| K0002 | 2018-09 |       0 |
| M0001 | 2012-11 |   10784 |
| M0001 | 2012-12 |   11145 |
| M0001 | 2018-09 |       0 |
| M0002 | 2012-11 |   12032 |
| M0002 | 2018-09 |       0 |
| N0001 | 2012-11 |    9965 |
| N0001 | 2012-12 |   11023 |
+-------+---------+---------+
16 rows in set (0.00 sec)