/* 問2 */
/*
著者情報テーブル（author）に対して、以下の内容で新規データを挿入してみましょう。
*/

/** 解答 **/
INSERT INTO -- データを挿入するテーブルを選択
    author -- 著者情報テーブル
VALUES -- 以下のデータを挿入
    (
        'I0001', -- 著者ID
        '井田健二', -- 著者名
        'イダケンジ', -- 著者名（カナ）
        NULL -- 生年月日
    )
;

/* 挿入前 */
+-----------+--------------+-----------------------+------------+
| author_id | name         | name_kana             | birth      |
+-----------+--------------+-----------------------+------------+
| A0001     | 有吉晴美     | アリヨシハルミ        | 1985-02-15 |
| K0001     | 川中智樹     | カワナカトモキ        | 1986-03-12 |
....
+-----------+--------------+-----------------------+------------+
7 rows in set (0.00 sec)

/* 挿入後 */
+-----------+--------------+-----------------------+------------+
| author_id | name         | name_kana             | birth      |
+-----------+--------------+-----------------------+------------+
| A0001     | 有吉晴美     | アリヨシハルミ        | 1985-02-15 |
| I0001     | 井田健二     | イダケンジ            | NULL       |
| K0001     | 川中智樹     | カワナカトモキ        | 1986-03-12 |
....
+-----------+--------------+-----------------------+------------+
8 rows in set (0.00 sec)